Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/InformationRegisters/ПС_ОбработкаДокументов/ПС_ОбработкаДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПС_ОбработкаДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Распознан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Найден</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прикреплен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Создан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИзвлеченныйТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеРеквизиты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ПС_ТипыРаспознанныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеСодержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/InformationRegisters/ПС_ОбработкаДокументов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьВидимостьАрхива();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбработатьВсеДокументыНаКлиенте", ПолучитьИнтервалАвтоматическойОбработки() * 60, Ложь);
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПоказыватьАрхивПриИзменении(Элемент)
	
	ОбновитьВидимостьАрхива();
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьКаталоги(Команда)
	
	ПС_ИндексацияФайловКлиент.ПроверитьКаталогиСФайлами();
	ПС_ИндексацияФайловВызовСервера.ПроверитьКаталогиСФайлами();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыбранныйФайл(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Состояние("Выполняется обработка документа");
	ПС_ИндексацияФайловКлиент.ОбработатьДокумент(ТекущиеДанные.ХешСумма, Истина);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВсеФайлы(Команда)
	
	ОбработатьВсеФайлыНаКлиенте(Истина);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВсеФайлыНаКлиенте(Вручную)
	
	МассивВсехНезавершенных = ПолучитьВсеНеобработанныеДокументыНаКлиенте();
	
	КоличествоЭлементов = МассивВсехНезавершенных.Количество();
	
	ТекНомер = 0;
	
	Для каждого ТекХешСумма Из МассивВсехНезавершенных Цикл
		
		Состояние("Выполняется обработка документов", Цел(ТекНомер / КоличествоЭлементов * 100));
		ПС_ИндексацияФайловКлиент.ОбработатьДокумент(ТекХешСумма, Вручную);
		
		ТекНомер = ТекНомер + 1;
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВсеДокументыНаКлиенте() Экспорт

	Если АвтоматическаяОбработка Тогда
		
		ПС_ИндексацияФайловКлиент.ПроверитьКаталогиСФайлами();
		ПС_ИндексацияФайловВызовСервера.ПроверитьКаталогиСФайлами();
		ОбработатьВсеФайлыНаКлиенте(Ложь);

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнтервалАвтоматическойОбработки()
	
	Возврат ПС_ИндексацияФайловВызовСервера.НастройкаРаспознаванияЧисло("ИнтервалАвтоматическойОбработкиМин", 1);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВсеНеобработанныеДокументыНаКлиенте()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПС_ОбработкаДокументов.ХешСумма КАК ХешСумма
	|ИЗ
	|	РегистрСведений.ПС_ОбработкаДокументов КАК ПС_ОбработкаДокументов
	|ГДЕ
	|	ПС_ОбработкаДокументов.ОбработкаЗавершена = ЛОЖЬ
	|	И ПС_ОбработкаДокументов.НаКлиенте = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивХешСумм = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивХешСумм.Добавить(Выборка.ХешСумма);
	КонецЦикла;	
	
	Возврат МассивХешСумм;
	
КонецФункции

&НаСервере
Процедура ОбновитьВидимостьАрхива()
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказыватьАрхив", ПоказыватьАрхив);
	
КонецПроцедуры

#КонецОбласти
